WindowsApplication1/WindowsApplication1/bin/Debug/Log/Request/getBuyQuote.xml

<soap:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header />
  <soap:Body>
    <getBuyQuote xmlns="http://api.ws.ba.com">
      <msgName>getBuyQuote</msgName>
      <ClientID>500056</ClientID>
      <branchID>12</branchID>
      <tranType>NON-INVENTORY</tranType>
      <userID>CHINATOWN</userID>
      <currCode>USD</currCode>
      <spreadType>STANDARD</spreadType>
      <foreignAmount>909.00</foreignAmount>
      <requestSecToken>KbptBXZuykAPj9lFyMaK/nLzmN5e0/zlnPv84ZFRffZcB98UTalWi3WZRvryquryeV0FTJwG9nRuFXXbaMbsKtyoft2pVvFb3+DJe/euoytdiFCvQYPZcoHulymJFOD0lrAj6f1OK4P5buFqR3X7fFR1kABs8U9ulp42y8QQdxLfXQHYH6VBvrP8hR9Xz0C1n+/N8E52hcTrZipaRShW0E/4WMJ/oetVGGuvxbnKciqffz/gcziAAZYgL/lHapuXuT0c//ng+uRAng0OyG0nUArmQ6atwEMRNfGLa7q/6MA=</requestSecToken>
    </getBuyQuote>
  </soap:Body>
</soap:Envelope>